# ConvToUnstyledRoof

## Description
Sets a roof to be unstyled.

```pascal
PROCEDURE ConvToUnstyledRoof(roof : HANDLE);
```

```python
def vs.ConvToUnstyledRoof(roof):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roof|HANDLE|The roof.|

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Roofs